1s/ERP/Conf/Documents/Лико_УстановкаВидаНастроечногоМатериала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_УстановкаВидаНастроечногоМатериала</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_БракСерий</xr:Item>
				<xr:Item>InformationRegister.Лико_ИсторияВидаНастроечногоМатериала</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБланка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срочность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_Срочность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПоНаработке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОпераций_ПередачаСоСклада</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтатусЗаявокНаСклад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРемонтРЦ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутренняяПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРаскрой</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗаказНаРаскрой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНастроечногоМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресХранения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаработкаТекущейОперации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеПоНаработке</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ИсторияВидаНастроечногоМатериала.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ИсторияВидаНастроечногоМатериала</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидНастроечногоМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_БракСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_БракСерий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дефект</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ДефектыМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеДефекта</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Решение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуМатериалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомментарийКРешению</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лико_ПередачаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_ЗабраковкаМатериалов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.Лико_УстановкаВидаНастроечногоМатериала</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ВозвратНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ВозвратНаСклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПоАктуРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаОтветсвенноеХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_СтатусЗаявокНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_СтатусЗаявокНаСклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_УстановкаВидаНастроечногоМатериала/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		ВидОперации=Перечисления.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства;
	КонецЕсли;	
КонецПроцедуры


Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата          = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	Если Справочники.Лико_РабочиеМеста.ПолучитьСвойство("ЗаполнениеСотрудникаВЗаявке",Ложь) Тогда
		Сотрудник=АвторДокумента;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ВвостановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры();
	
КонецПроцедуры

Процедура ВвостановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	МАКСИМУМ(Лико_ИсторияВидаНастроечногоМатериала.Период) КАК Период
	|ПОМЕСТИТЬ ВтПериод
	|ИЗ
	|	РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|ГДЕ
	|	Лико_ИсторияВидаНастроечногоМатериала.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериод.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_ИсторияВидаНастроечногоМатериала.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтПослЗнач
	|ИЗ
	|	ВтПериод КАК ВтПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|		ПО ВтПериод.ОбъектНоменклатуры = Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|			И ВтПериод.Период = Лико_ИсторияВидаНастроечногоМатериала.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтПослЗнач.ВидНастроечногоМатериала, ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.Пустаяссылка)) КАК ВидНастроечногоМатериала,
	|	Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_УстановкаВидаНастроечногоМатериала.Товары КАК Лико_УстановкаВидаНастроечногоМатериалаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПослЗнач КАК ВтПослЗнач
	|		ПО Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры = ВтПослЗнач.ОбъектНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.ОбъектНоменклатуры.ПолучитьОбъект();
		СпрОбъект.ВидНастроечногоМатериала=Выборка.ВидНастроечногоМатериала;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьСтатус() //+Лико m.shenderov 05.11.2018
	Передача=НайтиПередачу();
	
	
	Если Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Отменен Тогда
		
		
		Если ЗначениеЗаполнено(Передача) ТОгда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя отменить заявку т.к. она уже обработана складом!";
			Сообщение.Сообщить();	
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Передача) Тогда
		Если Передача.Проведен и  НЕ ДополнительныеСвойства.Свойство("УдалениеДОкументаПоЗаявке") Тогда
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Выдан;	
		Иначе
			Статус=Перечисления.Лико_СтатусЗаявокНаСклад.Подготовлен;
		КонецЕсли;
	Иначе
		Статус=Перечисления.Лико_СтатусЗаявокНаСклад.ВОбработке;
		
	КонецЕсли;
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 05.11.2018


Функция НайтиПередачу() //+Лико m.shenderov 05.11.2018
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПередачаТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПередачаТоваров КАК Лико_ПередачаТоваров
	|ГДЕ
	|	Лико_ПередачаТоваров.ЗаявкаНаСклад = &Ссылка
	|	И Не Лико_ПередачаТоваров.ПометкаУдаления
	|	И Лико_ПередачаТоваров.ЗаявкаНаСклад <> ЗНАЧЕНИЕ(Документ.Лико_ЗаявкаНаСклад.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
		
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 05.11.2018 

Процедура ОбработкаПроведения(Отказ, Режим)
	УстановитьПривилегированныйРежим(Истина);
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр Лико_ИсторияВидаНастроечногоМатериала
	Движения.Лико_ИсторияВидаНастроечногоМатериала.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Лико_ИсторияВидаНастроечногоМатериала.Добавить();
		Движение.Период = Дата;
		Движение.ОбъектНоменклатуры = ТекСтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.ВидНастроечногоМатериала = ?(ЗначениеЗаполнено(ТекСтрокаТовары.ВидНастроечногоМатериала),ТекСтрокаТовары.ВидНастроечногоМатериала,ВидНастроечногоМатериала);
		
		
		
	КонецЦикла;
	Если Не Отказ Тогда
		Для Каждого ТекСтрокаТовары Из Товары Цикл 	
			
			СпрОбъект=ТекСтрокаТовары.Серия.ЯССМ_ОбъектНоменклатуры.ПолучитьОбъект();
			СпрОбъект.ВидНастроечногоМатериала=?(ЗначениеЗаполнено(ТекСтрокаТовары.ВидНастроечногоМатериала),ТекСтрокаТовары.ВидНастроечногоМатериала,ВидНастроечногоМатериала);

			СпрОбъект.Записать();
			
			
			
		КонецЦикла;
		
	КонецЕсли; 
	
	
	УстановитьПривилегированныйРежим(Истина);	
	Движения.Лико_БракСерий.Записывать = Истина;
	
	Для каждого Материал Из Товары  Цикл 
		
		Движение 						=	Движения.Лико_БракСерий.Добавить();
		Движение.Серия					=	Материал.Серия;
		Движение.ОбъектНоменклатуры		=	Материал.Серия.ЯССМ_ОбъектНоменклатуры;
		Движение.Дефект					=	Дефект;
		Движение.Документ				=	Ссылка;
		Движение.ОписаниеДефекта		= 	ОписаниеДефекта;  
	

		
		
	КонецЦикла; 	

	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


Процедура УстановитьЗначениеВидНастроечногоМатериалаУОбъектовНоменклатуры()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	МАКСИМУМ(Лико_ИсторияВидаНастроечногоМатериала.Период) КАК Период
	|ПОМЕСТИТЬ ВтПериод
	|ИЗ
	|	РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|
	|СГРУППИРОВАТЬ ПО
	|	Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтПериод.ОбъектНоменклатуры КАК ОбъектНоменклатуры,
	|	Лико_ИсторияВидаНастроечногоМатериала.ВидНастроечногоМатериала КАК ВидНастроечногоМатериала
	|ПОМЕСТИТЬ ВтПослЗнач
	|ИЗ
	|	ВтПериод КАК ВтПериод
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ИсторияВидаНастроечногоМатериала КАК Лико_ИсторияВидаНастроечногоМатериала
	|		ПО ВтПериод.ОбъектНоменклатуры = Лико_ИсторияВидаНастроечногоМатериала.ОбъектНоменклатуры
	|			И ВтПериод.Период = Лико_ИсторияВидаНастроечногоМатериала.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВтПослЗнач.ВидНастроечногоМатериала, ЗНАЧЕНИЕ(Перечисление.Лико_ВидыНастроечногоМатериала.Пустаяссылка)) КАК ВидНастроечногоМатериала,
	|	Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры КАК ОбъектНоменклатуры
	|ИЗ
	|	Документ.Лико_УстановкаВидаНастроечногоМатериала.Товары КАК Лико_УстановкаВидаНастроечногоМатериалаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПослЗнач КАК ВтПослЗнач
	|		ПО Лико_УстановкаВидаНастроечногоМатериалаТовары.Серия.ЯССМ_ОбъектНоменклатуры = ВтПослЗнач.ОбъектНоменклатуры";
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект=Выборка.ОбъектНоменклатуры.ПолучитьОбъект();
		СпрОбъект.ВидНастроечногоМатериала=Выборка.ВидНастроечногоМатериала;
		СпрОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
		
	Если Дефект=Справочники.Лико_ДефектыМатериалов.НайтиПоНаименованию("Другое") Тогда
		ПроверяемыеРеквизиты.Добавить("ОписаниеДефекта");
	КонецЕсли; 
	
	МассивНепроверяемыхРеквизитов = Новый Массив;  
	МассивНепроверяемыхРеквизитов.Добавить("ВидНастроечногоМатериала");
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры
